HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5s_regdef.h
/** \\brief  OCDS Control and Status */
typedef struct _Ifx_PSI5S_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_PSI5S_OCS_Bits;

/** \\brief  Pulse Generation Control Register */
typedef struct _Ifx_PSI5S_PGC_Bits
{
    unsigned int TXCMD:5;                   /**< \brief [4:0] TX Command (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int ATXCMD:5;                  /**< \brief [12:8] Alternate TX Command (rw) */
    unsigned int reserved_13:2;             /**< \brief \internal Reserved */
    unsigned int TBS:1;                     /**< \brief [15:15] Time Base Select (rw) */
    unsigned int ETB:3;                     /**< \brief [18:16] External Time Base Select (rw) */
    unsigned int PTE:1;                     /**< \brief [19:19] Periodic Trigger Enable (rw) */
    unsigned int ETS:3;                     /**< \brief [22:20] External Trigger Select (rw) */
    unsigned int ETE:1;                     /**< \brief [23:23] External Trigger Enable (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5S_PGC_Bits;

/** \\brief  Receive Buffer Register */
typedef struct _Ifx_PSI5S_RBUF_Bits
{
    unsigned int RD_VALUE:9;                /**< \brief [8:0] Receive Data Register Value (rh) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_PSI5S_RBUF_Bits;

/** \\brief  Receiver Control Register A */
typedef struct _Ifx_PSI5S_RCRA_Bits
{
    unsigned int CRC0:1;                    /**< \brief [0:0] CRC or Parity Selection (rw) */
    unsigned int CRC1:1;                    /**< \brief [1:1] CRC or Parity Selection (rw) */
    unsigned int CRC2:1;                    /**< \brief [2:2] CRC or Parity Selection (rw) */
    unsigned int CRC3:1;                    /**< \brief [3:3] CRC or Parity Selection (rw) */
    unsigned int CRC4:1;                    /**< \brief [4:4] CRC or Parity Selection (rw) */
    unsigned int CRC5:1;                    /**< \brief [5:5] CRC or Parity Selection (rw) */
    unsigned int TSEN:1;                    /**< \brief [6:6] Time Stamp Enable (rw) */
    unsigned int TSP:1;                     /**< \brief [7:7] Time Stamp Select (rw) */
    unsigned int TSTS:1;                    /**< \brief [8:8] Time Stamp Trigger Select (rw) */
    unsigned int FIDS:1;                    /**< \brief [9:9] Frame ID Select (rw) */
    unsigned int WDMS:1;                    /**< \brief [10:10] Watch Dog Timer Mode Select (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int UFC0:2;                    /**< \brief [17:16] UART Frame Count per Packet Frame in Slot 0 (rw) */
    unsigned int UFC1:2;                    /**< \brief [19:18] UART Frame Count per Packet Frame in Slot 1 (rw) */
    unsigned int UFC2:2;                    /**< \brief [21:20] UART Frame Count per Packet Frame in Slot 2 (rw) */
    unsigned int UFC3:2;                    /**< \brief [23:22] UART Frame Count per Packet Frame in Slot 3 (rw) */
    unsigned int UFC4:2;                    /**< \brief [25:24] UART Frame Count per Packet Frame in Slot 4 (rw) */
    unsigned int UFC5:2;                    /**< \brief [27:26] UART Frame Count per Packet Frame in Slot 5 (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_PSI5S_RCRA_Bits;

/** \\brief  Receiver Control Register B */
typedef struct _Ifx_PSI5S_RCRB_Bits
{
    unsigned int PDL0:5;                    /**< \brief [4:0] Payload Data Length (rw) */
    unsigned int PDL1:5;                    /**< \brief [9:5] Payload Data Length (rw) */
    unsigned int PDL2:5;                    /**< \brief [14:10] Payload Data Length (rw) */
    unsigned int PDL3:5;                    /**< \brief [19:15] Payload Data Length (rw) */
    unsigned int PDL4:5;                    /**< \brief [24:20] Payload Data Length (rw) */
    unsigned int PDL5:5;                    /**< \brief [29:25] Payload Data Length (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_PSI5S_RCRB_Bits;

/** \\brief  Receive Data Register */
typedef struct _Ifx_PSI5S_RDR_Bits
{
    unsigned int RD0:1;                     /**< \brief [0:0] PSI5 Receive Data (r) */
    unsigned int RD1:1;                     /**< \brief [1:1] PSI5 Receive Data (r) */
    unsigned int RD2:1;                     /**< \brief [2:2] PSI5 Receive Data (r) */
    unsigned int RD3:1;                     /**< \brief [3:3] PSI5 Receive Data (r) */
    unsigned int RD4:1;                     /**< \brief [4:4] PSI5 Receive Data (r) */
    unsigned int RD5:1;                     /**< \brief [5:5] PSI5 Receive Data (r) */
    unsigned int RD6:1;                     /**< \brief [6:6] PSI5 Receive Data (r) */
    unsigned int RD7:1;                     /**< \brief [7:7] PSI5 Receive Data (r) */
    unsigned int RD8:1;                     /**< \brief [8:8] PSI5 Receive Data (r) */
    unsigned int RD9:1;                     /**< \brief [9:9] PSI5 Receive Data (r) */
    unsigned int RD10:1;                    /**< \brief [10:10] PSI5 Receive Data (r) */
    unsigned int RD11:1;                    /**< \brief [11:11] PSI5 Receive Data (r) */
    unsigned int RD12:1;                    /**< \brief [12:12] PSI5 Receive Data (r) */
    unsigned int RD13:1;                    /**< \brief [13:13] PSI5 Receive Data (r) */
    unsigned int RD14:1;                    /**< \brief [14:14] PSI5 Receive Data (r) */
    unsigned int RD15:1;                    /**< \brief [15:15] PSI5 Receive Data (r) */
    unsigned int RD16:1;                    /**< \brief [16:16] PSI5 Receive Data (r) */
    unsigned int RD17:1;                    /**< \brief [17:17] PSI5 Receive Data (r) */
    unsigned int RD18:1;                    /**< \brief [18:18] PSI5 Receive Data (r) */
    unsigned int RD19:1;                    /**< \brief [19:19] PSI5 Receive Data (r) */
    unsigned int RD20:1;                    /**< \brief [20:20] PSI5 Receive Data (r) */
    unsigned int RD21:1;                    /**< \brief [21:21] PSI5 Receive Data (r) */
    unsigned int RD22:1;                    /**< \brief [22:22] PSI5 Receive Data (r) */
    unsigned int RD23:1;                    /**< \brief [23:23] PSI5 Receive Data (r) */
    unsigned int RD24:1;                    /**< \brief [24:24] PSI5 Receive Data (r) */
    unsigned int RD25:1;                    /**< \brief [25:25] PSI5 Receive Data (r) */
    unsigned int RD26:1;                    /**< \brief [26:26] PSI5 Receive Data (r) */
    unsigned int RD27:1;                    /**< \brief [27:27] PSI5 Receive Data (r) */
    unsigned int PFC:4;                     /**< \brief [31:28] Packet Frame Count (r) */
} Ifx_PSI5S_RDR_Bits;

/** \\brief  Receive Status Register */
typedef struct _Ifx_PSI5S_RDS_Bits
{
    unsigned int XCRC0:1;                   /**< \brief [0:0] XCRC (r) */
    unsigned int XCRC1:1;                   /**< \brief [1:1] XCRC (r) */
    unsigned int XCRC2:1;                   /**< \brief [2:2] XCRC (r) */
    unsigned int XCRC3:1;                   /**< \brief [3:3] XCRC (r) */
    unsigned int XCRC4:1;                   /**< \brief [4:4] XCRC (r) */
    unsigned int XCRC5:1;                   /**< \brief [5:5] XCRC (r) */
    unsigned int XCRCI:1;                   /**< \brief [6:6] XCRC Error Flag (r) */
    unsigned int CRC0:1;                    /**< \brief [7:7] CRC (r) */
    unsigned int CRC1:1;                    /**< \brief [8:8] CRC (r) */
    unsigned int CRC2:1;                    /**< \brief [9:9] CRC (r) */
    unsigned int CRCI:1;                    /**< \brief [10:10] CRC Error Flag (r) */
    unsigned int ERR0:1;                    /**< \brief [11:11] Error signalling Flag 0 (r) */
    unsigned int ERR1:1;                    /**< \brief [12:12] Error signalling Flag 1 (r) */
    unsigned int HDI:1;                     /**< \brief [13:13] Header Error Signalled Flag (r) */
    unsigned int PE:1;                      /**< \brief [14:14] ASC Parity Error Flag (r) */
    unsigned int FE:1;                      /**< \brief [15:15] ASC Framing Error Flag (r) */
    unsigned int OE:1;                      /**< \brief [16:16] ASC Overrun Error Flag (r) */
    unsigned int TEI:1;                     /**< \brief [17:17] Time Error Flag (r) */
    unsigned int RBI:1;                     /**< \brief [18:18] Receive Buffer Overflow Flag (r) */
    unsigned int FID:3;                     /**< \brief [21:19] Frame ID (Frame Number) (r) */
    unsigned int CID:3;                     /**< \brief [24:22] Channel ID (Channel Number) (r) */
    unsigned int AFC:3;                     /**< \brief [27:25] Actual UART Frame Count (r) */
    unsigned int PFC:4;                     /**< \brief [31:28] Packet Frame Count (r) */
} Ifx_PSI5S_RDS_Bits;

/** \\brief  Send Control Register */
typedef struct _Ifx_PSI5S_SCR_Bits
{
    unsigned int PLL:5;                     /**< \brief [4:0] Pay Load Length of Registers SDRx (rw) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int EPS:2;                     /**< \brief [7:6] Enhanced Protocol Selection (rw) */
    unsigned int BSC:1;                     /**< \brief [8:8] Bit Stuffing Control (rw) */
    unsigned int reserved_9:5;              /**< \brief \internal Reserved */
    unsigned int FLUS:1;                    /**< \brief [14:14] Flush SDRx (w) */
    unsigned int reserved_15:7;             /**< \brief \internal Reserved */
    unsigned int CRC:1;                     /**< \brief [22:22] CRC Generation Control (rw) */
    unsigned int STA:1;                     /**< \brief [23:23] Start Sequence Generation Control (rw) */
    unsigned int reserved_24:2;             /**< \brief \internal Reserved */
    unsigned int TPF:1;                     /**< \brief [26:26] Transmit in Progress Flag (r) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_PSI5S_SCR_Bits;

